{"editor-devtools/help-title":"Instrumente pentru Dezvoltatori Scratch 3","editor-devtools/changes024":"Modificări în 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + Spațiu sau Clic Mijloc","editor-devtools/fixes":"Repară","editor-devtools/fixes-desc":"Soluție pentru caseta de inserare care nu apare la încărcarea proiectului. Ctrl+Stânga sau dreapta când încercați să introduceți text.","editor-devtools/code-tab-features":"Funcții pentru Fila Codului","editor-devtools/interactive-find-bar":"Bară de căutare interactivă (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Găsește și mergi la orice Bloc Personalizat, Variabilă, Eveniment, sau bloc Pălărie definit într-un personaj rapid, apăsând pe noua bară de căutare aflată în dreapta filelor Cod, Costume și Sunete. Începe să tastezi pentru a căuta în listă. Folosește tastele cu săgeată sus și jos pentru a naviga între opțiunile posibile, și săgețile stânga și dreapta pentru a vedea toate locurile găsite unde apare acel bloc.","editor-devtools/improved-tidy-up":"Aranjare a blocurilor îmbunătățită","editor-devtools/copy-to-clipboard":"Copiază în Clipboard","editor-devtools/copy-to-clipboard-desc":"Clic-dreapta pe un bloc și 3 noi opțiuni vor apărea: Copiază Toate, Copiază Blocul, și Decupează Blocul. Opțiunea Copiază Toate va copia totul incluzând și ceea ce este sub blocul pe care ai dat clic. Copază Blocul va copia doar blocul curent și componentele lui, dar nimic de dedesupt. Și opțiunea Decupează Blocul în va și copia și îl va și elimina din spațiul de lucru.","editor-devtools/paste-from-clipboard":"Inserează din Clipboard","editor-devtools/paste-from-clipboard-desc":"Inserează din clipboard, dar cel mai important, inserează unde este cursorul mouse-ului tău ca tu apoi să poți să îl plasezi (mai bine decât să-l plasezi de unde l-ai copiat, ca în implementarea Scratch actuală).","editor-devtools/swap-variable":"Transferă Variabila în Personaj","editor-devtools/swap-variable-desc":"Clic dreapta pe o variabilă în script-urile tale pentru această nouă opțiune. Îți permite să schimbi în același timp toate referințele la această variabilă în personajul actual cu o altă variabilă. Este folositor când ai făcut o greșeală și vrei să schimbi variabilele dintr-una într-alta sau trebuie să schimbi dintr-o variabilă „pentru toate personajele” într-una „doar pentru acest personaj”. Această opțiune nu va elimina variabila cea veche și nu va afecta alte variabile ale personajelor.","editor-devtools/middleclick":"Clic Mijloc","editor-devtools/middleclick-desc":"Folosirea butonului din mijloc al mouse-ului pe o variabilă sau un bloc personalizat îți permite să mergi direct la definiția lui sau să îl/o deschizi în bara de căutare interactivă.","editor-devtools/ctrl-lr":"Ctrl + Stânga, Ctrl + Dreapta","editor-devtools/ctrl-lr-desc":"Navighează la anterioara / următoarea poziție vizitată în fereastra script-urilor (după folosirea navigării la bloc sau bara de căutare). Îți permite să dai clic-mijloc pe un bloc personalizat pentru a merge la definiția lui, apoi apasă ctrl + Stânga pentru a merge înapoi unde ai fost înainte.","editor-devtools/costume-tab-features":"Funcții pentru Fila Costumelor","editor-devtools/find-bar":"Bara de Căutare","editor-devtools/find-bar-costume-desc":"Apasă-o pentru a enumera toate costumele după nume, și tastează pentru a localiza unul. Folosește tastele cu săgeată sau mouse-ul ca să dai clic pe un nume pentru a merge direct la acel costum.","editor-devtools/ctrl-lr-costume-desc":"Aceste taste te mută la costumul anterior / următor în personaj.","editor-devtools/send-top-bottom":"Trimite în Vârf, Trimite în Partea de Jos","editor-devtools/send-top-bottom-desc":"Clic dreapta pe un costum și 2 noi opțiuni apar în meniu. Acestea pot fi folosite pentru a trimite personajul respectiv în topul sau în josul listei de costume pentru o reordonare rapidă.","editor-devtools/youtube":"Tutoriale YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Am găsit 1 bloc de tip reporter nefolosit. Ar trebui să îl șterg pentru tine?} few {Griffpatch: Am găsit # blocuri de tip reporter nefolosite. Ar trebui să le șterg pentru tine?} other {Griffpatch: Am găsit # de blocuri din tipul reporter nefolosite. Ar trebui să le șterg pentru tine?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Am găsit 1 variabilă locală nefolosită. Ar trebui să o șterg pentru tine? Aici este:\n} few {Griffpatch: Am găsit # variabile locale nefolosite. Ar trebui să le șterg pentru tine? Aici sunt:\n} other {Griffpatch: Am găsit # de variabile locale nefolosite. Ar trebui să le șterg pentru tine? Aici sunt:\n} }","editor-devtools/searching-in":"Se caută în {name}","editor-devtools/var-not-exist":"Acea variabilă nu există...","editor-devtools/find":"Caută","editor-devtools/find-placeholder":"Caută (Ctrl+F)","editor-devtools/deep":"Adâncime","editor-devtools/help":"Ajutor","editor-devtools/tutorials":"Tutoriale","editor-devtools/enter-expr":"Griffpatch: Introdu o expresie (de ex. a+2*3)","editor-devtools/replace":"Griffpatch: Schimbă toate {name} în acest personaj pentru variabila numită:","editor-devtools/paste":"Inserează","editor-devtools/copy-all":"Copiază Toate","editor-devtools/copy-block":"Copiază Blocul","editor-devtools/cut-block":"Decupează Blocul","editor-devtools/lists":"liste","editor-devtools/variables":"variabile","editor-devtools/insert":"Inserează","editor-devtools/start-typing":"Începe să Tastezi...","editor-devtools/extension-description-not-for-addon":"Instrumente pentru Dezvoltatori Scratch 3 pentru a mări Experiența ta în Editarea Scratch pe https://scratch.mit.edu","editor-devtools/@name":"Instrumente pentru dezvoltatori","editor-devtools/@description":"Adaugă o bară de căutare și noi opțiuni pentru meniurile din editor: copiază/inserează blocuri, aranjare a blocurilor mai bună, mergi la definiția blocului personalizat, și multe altele!"}