{"editor-devtools/help-title":"Strumenti per Sviluppatori di Scratch 3","editor-devtools/help-by":"di {url} e dagli svlluppatori e traduttori degli Scratch Addons","editor-devtools/changes024":"Modifiche in 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + Spazio o clic col tasto centrale","editor-devtools/ctrl-space-desc":"Fa comparire una casella di testo fluttuante dove puoi digitare il nome di un blocco (o parte di esso) e trascinare il blocco nel codice per usarlo in quel punto.","editor-devtools/fixes":"Correzioni","editor-devtools/fixes-desc":"Risolto il problema per cui la casella di testo non veniva visualizzata al caricamento del progetto. Risolto il problema con la pressione di Ctrl + Sinistra o Destra durante l'inserimento del testo.","editor-devtools/code-tab-features":"Funzioni Scheda Codice","editor-devtools/interactive-find-bar":"Barra di Ricerca Interattiva (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Trova velocemente Blocchi Personalizzati, Variabili, Situazioni o Cappelli definiti in un certo sprite cliccando sulla nuova barra di ricerca a destra delle schede Codice, Costumi e Suoni. Inizia a scrivere per filtrare la lista. Usa le frecce su e giù per scorrere nei risultati e le frecce destra e sinistra per passare alle diverse istanze del blocco selezionato.","editor-devtools/improved-tidy-up":"Funzione migliorata di Riordino dei Blocchi di Codice ","editor-devtools/improved-tidy-up-desc":"Fai click nell'area degli script per far comparire il menu e vedrai che l'opzione Riodina i Blocchi sarà rimpiazzata dall'opzione Riordina i Blocchi (+). Usala per riordinare i tuoi script preservando le colonne in cui gli hai disposti, tenendo il più possibile allineati i commenti, rimuovendo le variabili inutilizzate, ecc. Ti piacerà un sacco, garantito! ","editor-devtools/help-new":"★Nuovo★","editor-devtools/help-make-space":"Fai Spazio","editor-devtools/help-make-space-desc":"Crea uno spazio maggiore attorno ad uno script cliccandolo con il tasto destro e selezionando \"Fai Spazio\"","editor-devtools/copy-to-clipboard":"Copia negli Appunti","editor-devtools/copy-to-clipboard-desc":"Clic destro su un blocco e sono disponibili 3 nuove opzioni per Copia Tutti, Copia un Blocco e Taglia un Blocco. Copia Tutti copierà il blocco e tutti i blocchi sotto di esso negli appunti. Copia Blocco copierà solo il blocco corrente e i suoi contenuti. E Taglia Blocco lo copierà e lo rimuoverà dall'area di lavoro.","editor-devtools/paste-from-clipboard":"Incolla dagli Appunti","editor-devtools/paste-from-clipboard-desc":"Incolla dagli appunti nel punto in cui si trova il cursore del mouse in modo che tu possa posizionare i blocchi in quel punto (invece di posizionarli nel punto da cui li hai copiati, come accade normalmente in Scratch).","editor-devtools/swap-variable":"Sostituisci Variabile nello Sprite","editor-devtools/swap-variable-desc":"Clic destro su una variabile nei tuoi script. Ti permette di sostituire tutti i riferimenti a questa variabile nello sprite attuale con un'altra variabile. Questo è utile per quando fai un errore e vuoi passare da una variabile a un'altra o se hai bisogno di passare da 'Per tutti gli sprite' a 'Solo per questo sprite' o viceversa. La variabile vecchia non verrà rimossa.","editor-devtools/middleclick":"Clic centrale","editor-devtools/middleclick-desc":"Usa il tasto centrale del mouse su una variabile o su un blocco personalizzato per passare alla sua definizione o per aprirlo nella barra di ricerca interattiva.","editor-devtools/ctrl-lr":"Ctrl + Destra, Ctrl + Sinistro","editor-devtools/ctrl-lr-desc":"Naviga alla posizione visitata precedentemente/successivamente nell'area degli script (dopo aver usato la funzione naviga al blocco o la barra di ricerca). Questo ti permette di fare clic centrale su un blocco personalizzato per andare alla sua definizione e di tornare dove eri prima premendo Ctrl + Sinistra.","editor-devtools/costume-tab-features":"Funzioni nella Scheda dei Costumi","editor-devtools/find-bar":"Barra di Ricerca","editor-devtools/find-bar-costume-desc":"Clicca per elencare tutti i costumi per nome e scrivi per individuarne uno. Usa i tasti freccia o il mouse per cliccare su un nome per raggiungere direttamente quel costume.","editor-devtools/ctrl-lr-costume-desc":"Usa questi tasti per navigare al costume precedente/seguente nello sprite.","editor-devtools/send-top-bottom":"Porta in Cima, Porta in Fondo","editor-devtools/send-top-bottom-desc":"Clic destro su un costume e vedrai 2 nuovi elementi nel menu. Questi possono essere usati per spostare il costume selezionato in cima o in fondo nella lista dei costumi per riordinare i costumi velocemente.","editor-devtools/youtube":"Tutorial YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch: 1 blocco solitario trovato. Cancellarlo?} other {Griffpatch: trovati # monitor isolati. Vuoi rimuoverli?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: 1 variabile locale non usata: Cancellarla? Eccola qui:\n} other {Griffpatch: trovate # variabili locali non usate: Vuoi rimuoverle? Eccole qui:\n} }","editor-devtools/searching-in":"Cerca in {name}","editor-devtools/var-not-exist":"Questa variabile non esiste...","editor-devtools/find":"Trova","editor-devtools/find-placeholder":"Trova (Ctrl + F)","editor-devtools/deep":"Profondo","editor-devtools/help":"Aiuto","editor-devtools/tutorials":"Tutorial","editor-devtools/enter-expr":"Griffpatch: Inserisci un'espressione (ad es. a+2*3)","editor-devtools/replace":"Griffpatch: Sostituisci ogni {name} in questo sprite con la variabile:","editor-devtools/top":"Manda in Cima","editor-devtools/bottom":"Mando in Fondo","editor-devtools/clean-plus":"Riordina i Blocchi (+)","editor-devtools/paste":"Incolla","editor-devtools/copy-all":"Copia Tutti","editor-devtools/copy-block":"Copia il Blocco","editor-devtools/cut-block":"Taglia il Blocco","editor-devtools/make-space":"Fai Spazio","editor-devtools/swap":"Scambia {var} nello Sprite","editor-devtools/lists":"liste","editor-devtools/variables":"variabili","editor-devtools/insert":"Inserisci","editor-devtools/start-typing":"Inizia a Scrivere...","editor-devtools/extension-description-not-for-addon":"Strumenti di sviluppo per Scratch 3 per migliorare la tua esperienza di programmazione su https://scratch.mit.edu","editor-devtools/@name":"Strumenti per sviluppatori","editor-devtools/@description":"Aggiunge una casella di ricerca e nuove opzioni nei menu all'editor: copia/incolla blocchi, riordina blocchi migliorato, vai alla definizione di un blocco personalizzato e molto altro!","editor-devtools/@info-shortcuts":"Premi \"Ctrl+F\" per spostarti sulla casella di ricerca, \"Ctrl+Space\" per far comparire il menu \"aggiungi blocco per nome\", \"Ctrl+Left/Right\" per navigare la cronologia delle ricerche.","editor-devtools/@settings-name-enableCleanUpPlus":"Migliora \"Riordina i Blocchi\"","editor-devtools/@settings-name-enablePasteBlocksAtMouse":"Incolla i blocchi dove si trova il puntatore del mouse.","editor-devtools/@settings-name-enableMiddleClickFinder":"Clicca nel centro i blocchi delle variabili, i blocchi personalizzati o gli eventi per cercarne altre occorrenze"}