{"editor-devtools/help-title":"Herramientas de Desarrollador de Scratch 3","editor-devtools/help-by":"por {url} y contribuidores y traductores de Scratch Addons","editor-devtools/changes024":"Cambios en 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + Espacio o click medio","editor-devtools/ctrl-space-desc":"Pone una ventana flotante donde puedes escribir el nombre de un bloque (o partes de él) y arrastrar el bloque al código para usarlo allí.","editor-devtools/fixes":"Arreglos","editor-devtools/fixes-desc":"Arregla la barra de busqueda no apareciendo cuando carga el proyecto. Arregla presionar Ctrl+Izquierda o Derecha al intentar ingresar texto.","editor-devtools/code-tab-features":"Funciones de la Pestaña de Código","editor-devtools/interactive-find-bar":"Barra de Búsqueda Interactiva (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Rápidamente busque y salte a cualquier bloque propio, variable, evento o bloque sombrero definido en un objeto clickeando en la nueva barra de búsqueda ubicada a la derecha de las pestañas de Código, Disfraces y Sonidos. Empiece a escribir para filtrar la lista. Use las teclas arriba y abajo para cambiar entre las posibles entradas y las flechas izquierda y derecha para revisar cada resultado de ese bloque.","editor-devtools/improved-tidy-up":"Ordenado de Bloques Mejorado","editor-devtools/improved-tidy-up-desc":"Haga click derecho en la ventana de código para mostrar el menú y la opción de ordenar bloques será reemplazada por una opción de \"Ordenar Bloques +\". Use esto para ordenar sus scripts, preservando las columnas como también intentando alinear los comentarios y quitar toda variable huérfana, etc. ¡Le va a encantar, se lo garantizo!\n ","editor-devtools/help-new":"★Nuevo★","editor-devtools/help-make-space":"Hacer Espacio","editor-devtools/help-make-space-desc":"Haga espacio extra alrededor de un script haciéndole click derecho y eligiendo \"Hacer Espacio\".","editor-devtools/copy-to-clipboard":"Copiar al Portapapeles","editor-devtools/copy-to-clipboard-desc":"Haga click derecho a un bloque y 3 nuevas opciones estarán disponisbles: Copiar Todos, Copiar Bloque y Cortar Bloque. El botón Copiar Todos copiará todo incluido abajo del bloque que clickeaste. Copiar Bloque solo copiará el bloque actual y sus contenidos, pero nada de abajo. Cortar Bloque lo copiará y lo eliminará.","editor-devtools/paste-from-clipboard":"Pegar del Portapapeles","editor-devtools/paste-from-clipboard-desc":"Pega del portapapeles, pero lo pega donde está su cursor del ratón para que puedas posicionarlo (en vez de ponerlo donde lo copió, como la implementación actual de Scratch).","editor-devtools/swap-variable":"Intercambiar Variable en Objeto","editor-devtools/swap-variable-desc":"Haga click derecho a una variable en la parte de código para esta nueva opción. Te permite intercambiar todas las referencias a esta variable en el objeto actual a otra variable. Esto es bueno para cuando cometió un error y quiere cambiar todas las referencias a una variable a otra o tiene que cambiar \"para todos los objetos\" a \"solo para este objeto\". Esta opción no quitará la variable antigua y no afectará las variables de otros objetos.","editor-devtools/middleclick":"Click Medi","editor-devtools/middleclick-desc":"Usando el botón del medio del ratón en una variable o bloque propio, puedes saltar a su definición o abrirlo en la barra de búsqueda interativa.","editor-devtools/ctrl-lr":"Ctrl + Izquierda, Ctrl + Derecha","editor-devtools/ctrl-lr-desc":"Navegue a la posición siguiente o anterior de la ventana de código (luego de usar la función \"navegar a bloque\" o la barra de búsqueda). Esto le permite hacer click medio en un bloque propio para ir a su definición, luego presione Ctrl + Izquierda para volver donde estaba antes.","editor-devtools/costume-tab-features":"Funciones de la Pestaña de Disfraces","editor-devtools/find-bar":"Barra de Búsqueda","editor-devtools/find-bar-costume-desc":"Haga click para listar todos los disfraces por nombre, y escriba para encontrar uno solo. Use las flechas o el ratón para clickear un nombre e ir directamente a ese disfraz.","editor-devtools/ctrl-lr-costume-desc":"Estas flechas le permiten navegar al anterior o próximo disfraz del objeto.","editor-devtools/send-top-bottom":"Mandar al Frente, Mandar al Fondo","editor-devtools/send-top-bottom-desc":"Haga click derecho a un disfraz y 2 nuevas opciones estarán presentes. Estas pueden ser usadas para enviar el disfraz actual al frente o al final de la lista de disfraces para un reordenado rápido.","editor-devtools/youtube":"Tutoriales en YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch: encontré 1 bloque huérfano. ¿Debería borrarlo?} other {Griffpatch: encontré # bloques huérfanos. ¿Debería borrarlos?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: encontré 1 variable locales sin usar. ¿Debería borrarla? Esta es:} other {Griffpatch: encontré # variables locales sin usar. ¿Debería borrarlas? Estas son:\n} }","editor-devtools/searching-in":"Buscando en {name}","editor-devtools/var-not-exist":"Esa variable no existe..","editor-devtools/find":"Buscar","editor-devtools/find-placeholder":"Buscar (Ctrl+F)","editor-devtools/deep":"Profundo","editor-devtools/help":"Ayuda","editor-devtools/tutorials":"Tutoriales","editor-devtools/enter-expr":"Griffpatch: ingrese una expresión (por ejemplo, a+2*3)","editor-devtools/replace":"Griffpatch: cambiar todos los {name} en este objeto por la variable llamada:","editor-devtools/top":"Mandar al Frente","editor-devtools/bottom":"Mandar al Fond","editor-devtools/clean-plus":"Ordenar Bloques +","editor-devtools/paste":"Pegar","editor-devtools/copy-all":"Copiar Todos","editor-devtools/copy-block":"Copiar Bloque","editor-devtools/cut-block":"Cortar Bloque","editor-devtools/make-space":"Hacer Espacio","editor-devtools/swap":"Intercambiar Variable {var} en Objeto","editor-devtools/lists":"listas","editor-devtools/insert":"Insertar","editor-devtools/start-typing":"Empiece a escribir...","editor-devtools/extension-description-not-for-addon":"Herramientas de Desarrollador de Scratch 3 para mejorar su experiencia editando en https://scratch.mit.edu","editor-devtools/@name":"Herramientas de desarrollador","editor-devtools/@description":"Agrega una barra de búsqueda y nuevas opciones de menú para el editor: copie y pegue bloques, ordene de mejor manera, vaya directamente a la definición de un bloque propio y más.","editor-devtools/@info-shortcuts":"Presione \"Ctrl+F\" para enfocar la barra de búsqueda, \"Ctrl+Espacio\" para abrir la ventana flotante de \"encontrar bloque por nombre\", \"Ctrl+Izquierda/Derecha\" para navegar el historial de búsqueda.","editor-devtools/@settings-name-enableCleanUpPlus":"Mejorar \"Ordenar Bloques\"","editor-devtools/@settings-name-enablePasteBlocksAtMouse":"Pegar bloques en la posición del cursor","editor-devtools/@settings-name-enableMiddleClickFinder":"Click medio del mouse en variables, bloques personalizados o eventos para navegar"}