{"editor-devtools/help-title":"Narzędzia deweloperskie Scratch 3","editor-devtools/fixes-desc":"Naprawiono nie pojawianie się pola wprowadzania podczas ładowania projektu. Naprawiono naciskanie klawiszy Ctrl + Lewo lub Prawo podczas próby wprowadzenia tekstu.","editor-devtools/interactive-find-bar-desc":"Szybko znajdź i przejdź do dowolnego bloku niestandardowego, zmiennej, zdarzenia lub kapelusza zdefiniowanego w duszku, klikając nowy pasek wyszukiwania znajdujący się po prawej stronie zakładek Kod, Kostiumy i Dźwięk. Zacznij pisać, aby przefiltrować listę. Użyj klawiszy strzałek w górę iw dół, aby przełączać się między możliwymi wpisami, a strzałek w lewo i w prawo, aby przełączać się między wszystkimi znalezionymi instancjami tego bloku.","editor-devtools/paste-from-clipboard-desc":"Wkleja ze schowka, ale co ważne, wkleja go tam, gdzie znajduje się kursor myszy, dzięki czemu można go umieścić (zamiast umieszczać go w miejscu, z którego został skopiowany, tak jak w przypadku obecnej implementacji scratch).","editor-devtools/swap-variable-desc":"Kliknij prawym przyciskiem myszy zmienną w skryptach dla tej nowej opcji. Pozwala na przełączenie wszystkich odwołań do tej zmiennej w aktualnym duszku za jednym razem do innej zmiennej. Jest to świetne rozwiązanie, gdy popełniłeś błąd i chcesz przełączyć się z jednej zmiennej na inną lub musisz zmienić z „dla wszystkich duszków” na „tylko dla tego duszka”. Ta opcja nie usunie starej zmiennej i nie wpłynie na żadne inne zmienne duszków.","editor-devtools/middleclick":"Kliknij środkowym przyciskiem","editor-devtools/find-bar-costume-desc":"Kliknij, aby wyświetlić listę wszystkich kostiumów według nazwy, i wpisz, aby znaleźć jeden. Użyj klawiszy strzałek lub myszy, aby kliknąć nazwę, aby przejść bezpośrednio do tego kostiumu.","editor-devtools/send-top-bottom":"Wyślij na górę, Wyślij na dół","editor-devtools/youtube":"przewodniki na youtube","editor-devtools/find":"Wyszukaj","editor-devtools/find-placeholder":"Wyszukaj (Ctrl+F)","editor-devtools/help":"pomoc","editor-devtools/tutorials":"przewodniki","editor-devtools/paste":"Wklej","editor-devtools/copy-all":"Kopiuj Wszystko","editor-devtools/copy-block":"Kopiuj Blok","editor-devtools/lists":"listy","editor-devtools/variables":"zmienne","editor-devtools/@name":"Narzędzia Developerskie"}