{"editor-devtools/help-title":"Outils de Développement pour Scratch 3","editor-devtools/changes024":"Modifications et nouveautés en 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl+Espace ou Clic De Molette","editor-devtools/fixes":"Corrections","editor-devtools/fixes-desc":"Problème de la boîte de dialogue qui n'appraissait pas au chargement d'un projet fixé. Correction pour l'utilisation de Ctrl+Gauche ou Droite lorsque l'on essaye d'entrer du texte.","editor-devtools/code-tab-features":"Fonctionnalités De l'Onglet de Code","editor-devtools/interactive-find-bar":"Barre De Recherche Interactive (Ctrl+F)","editor-devtools/interactive-find-bar-desc":"Trouve et atteint rapidement n'importe quel Bloc Personnalisé, d'Evènement ou de départ et n'importe  quelle variable définie dans un sprite en cliquant sur la nouvelle barre de recherche à droite des onglets de Code, Costumes et Son. Commencez par écrire pour filtrer au plus possible la liste. Utilisez les flèches haut et bas pour changer entre les différentes possibilités, et utilisez les flèches gauche et droite pour aller à chaque instance de ce bloc dans le sprite.","editor-devtools/improved-tidy-up":"Nettoyage Des Blocs Amélioré","editor-devtools/copy-to-clipboard":"Copier dans le Presse-Papiers","editor-devtools/copy-to-clipboard-desc":"Faites un clic droit sur un bloc et 3 nouvelles options seront disponibles : Copier tout, Copier le Bloc et Couper le Bloc. Le bouton Copier Tout copiera le bloc entier dans le presse-papiers, comprenant les blocs intégrés dans celui-ci et ceux accrochés au dessous. Copier le Bloc copiera uniquement le bloc ainsi que les blocs intégrés dans celui-ci, mais aucun en dessous. Couper le Bloc copiera le bloc et le supprimera ensuite de l'espace de travail.","editor-devtools/paste-from-clipboard":"Coller à partir du presse-papiers","editor-devtools/paste-from-clipboard-desc":"Colle depuis le presse-papiers, mais surtout le colle où votre souris se situe pour pouvoir le placer (meilleur que le placer là où vous l'avez copié, système actuellement implémenté dans Scratch)","editor-devtools/swap-variable":"Echanger des Variables dans un Sprite","editor-devtools/swap-variable-desc":"Faites un clic droit sur une variable dans votre code pour cette nouvelle option. Elle vous permet d'échanger toutes les références à cette variable dans le sprite actuel d'un seul coup vers une autre variable. C'est idéal lorsque vous avez fait une erreur et que vous voulez échanger d'une variable à une autre ou que vous voulez changer de \"pour tous les sprites\" à \"pour ce sprite uniquement\". Cette option ne supprimera pas l'ancienne variable et n'affectera aucun autre variable du sprite.","editor-devtools/middleclick":"Clic du milieu","editor-devtools/middleclick-desc":"Utiliser le clic du milieu sur une variable ou un bloc personnalisé vous permet d'aller directement à sa définition ou l'ouvre dans la barre de recherche interactive.","editor-devtools/ctrl-lr":"Ctrl+Gauche, Ctrl+Droite","editor-devtools/ctrl-lr-desc":"Naviguer à la précédente/prochaine position visitée dans la fenêtre de code (après avoir utilisé aller au bloc ou la barre de recherche). Cela vous permet d'effectuer un clic du milieu sur un bloc personnalisé pour aller à sa définition, puis d'appuyer sur Ctrl+Gauche pour revenir là où vous étiez juste avant.","editor-devtools/costume-tab-features":"Fonctionnalités De l'Onglet Des Costumes","editor-devtools/find-bar":"Barre De Recherche","editor-devtools/find-bar-costume-desc":"Cliquez pour lister tous les costumes par nom et types pour en identifier un. Utilisez les flèches directionnelles ou la souris pour cliquer sur un nom et aller directement à ce costume.","editor-devtools/ctrl-lr-costume-desc":"Ces touches vous font naviguer au précédent/prochain costume dans le sprite.","editor-devtools/send-top-bottom":"Envoyer en Haut, Envoyer en Bas","editor-devtools/send-top-bottom-desc":"Faites un clic droit sur un costume et 2 nouvelles options seront présentes. Elles peuvent être utilisées pour envoyer un costume tout en haut ou tout en bas de la liste des costumes pour une réorganisation rapide.","editor-devtools/youtube":"Tutoriels YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch : J'ai trouvé 1 bloc orphelin. Dois-je les supprimer pour vous ?} other {Griffpatch : J'ai trouvé # blocs de valeur seuls. Dois-je les supprimer pour vous ?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch : J'ai trouvé 1 variable locale inutilisée. Dois-je les supprimer pour vous ? Les voici :\n} other {Griffpatch : J'ai trouvé # variables locales inutilisées. Dois-je les supprimer pour vous ? Ce sont ces variables :\n} }","editor-devtools/searching-in":"Chercher dans {name}","editor-devtools/var-not-exist":"Cette variable n'existe pas...","editor-devtools/find":"Chercher","editor-devtools/find-placeholder":"Chercher (Ctrl+F)","editor-devtools/deep":"Profond","editor-devtools/help":"Aide","editor-devtools/tutorials":"Tutoriels","editor-devtools/enter-expr":"Griffpatch : Entrez une expression (par exemple a+2*3)","editor-devtools/replace":"Griffpatch : Échanger la variable {name} dans ce sprite pour la variable nommée :","editor-devtools/paste":"Coller","editor-devtools/copy-all":"Tout Copier","editor-devtools/copy-block":"Copier Le Bloc","editor-devtools/cut-block":"Couper le bloc","editor-devtools/lists":"listes","editor-devtools/insert":"Insérer","editor-devtools/start-typing":"Commencez à écrire...","editor-devtools/extension-description-not-for-addon":"Les Outils de Développeur Scratch 3 pour améliorer votre expérience d'Edition Scratch sur https://scratch.mit.edu","editor-devtools/@name":"Outils pour Développeurs","editor-devtools/@description":"Ajoute une une barre de recherche et de nouvelles options de menus à l'éditeur : copier/coller des blocs, un meilleur nettoyage, aller à la définition d'un bloc personnalisé, et plus !"}