{"editor-devtools/help-title":"Scratch 3 Developer Tools","editor-devtools/version":"Version {version} - Released {date} {ndash} by {url} and Scratch Addons contributors & translators","editor-devtools/changes024":"Changes in 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + Space or Middle Click","editor-devtools/ctrl-space-desc":"Experimental Feature - This pops up a floating input box where you can type the name of a block (or parts of it) and drag the block into the code to make use of it right there.","editor-devtools/fixes":"Fixes","editor-devtools/fixes-desc":"Fix for input box not appearing on project load. Fix for pressing Ctrl+Left or Right while trying to enter text.","editor-devtools/code-tab-features":"Code Tab Features","editor-devtools/interactive-find-bar":"Interactive Find Bar (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Quickly find and jump to any Custom Block, Variable, Event, or Hat block defined in a sprite by clicking on the new find bar located to the right of the Code, Costumes and Sound tabs. Begin typing to filter down the list. Use the up and down arrow keys to switch between the possible entries, and the left and right arrows to cycle between al found instances of that block.","editor-devtools/improved-tidy-up":"Improved Code Tidy Up","editor-devtools/improved-tidy-up-desc":"Right click on the scripts window to pop up the menu and the clean up blocks option will have been replaced by a Clean Up Blocks (+) option. Se this to tidy your scripts and it will preserve your scripts columns as well as attempt to align the comments and remove all those orphaned variables, etc. You'll like this a lot I guarantee!","editor-devtools/copy-to-clipboard":"Copy to Clipboard","editor-devtools/copy-to-clipboard-desc":"Right click a block and 3 new options are available to Copy All, Copy Block, and Cut Block. The Copy All will copy to the clipboard everything including and below the block you clicked on. Copy block will only copy the current block and its contents, but nothing below. And cut block will copy it and remove it from the workspace.","editor-devtools/paste-from-clipboard":"Paste from Clipboard","editor-devtools/paste-from-clipboard-desc":"Pastes from the clipboard, but importantly pastes it where your mouse cursor is so you can then place it (rather than placing it where you copied it from like the current scratch implementation).","editor-devtools/swap-variable":"Swap Variable in Sprite","editor-devtools/swap-variable-desc":"Right click a variable in your scripts for this new option. It allows you to switch all references to this variable in the current sprite all in one go to another variable. This is great for when you made a mistake and want to switch from one variable to another or need to change from a 'for all sprites' to a 'for this sprite only'. This option will not remove the old variable and will not affect any other sprites variables.","editor-devtools/middleclick":"Middle Click","editor-devtools/middleclick-desc":"Using the middle mouse button on a variable or custom block allows you to jump to its definition or open it in the interactive find bar.","editor-devtools/ctrl-lr":"Ctrl + Left, Ctrl + Right","editor-devtools/ctrl-lr-desc":"Navigate to previous / next visited position in the script window (after using the navigate to block or find bar). This allows you to middle click a custom block to go to its definition, then press ctrl + Left to go back to where you were before.","editor-devtools/costume-tab-features":"Costumes Tab Features","editor-devtools/find-bar":"Find Bar","editor-devtools/find-bar-costume-desc":"Click to list all costumes by name, and type to locate one. Use the arrow keys or mouse to click a name to just straight to that costume.","editor-devtools/ctrl-lr-costume-desc":"These keys navigate you to the previous / next costume in the sprite.","editor-devtools/send-top-bottom":"Send to Top, Send to Bottom","editor-devtools/send-top-bottom-desc":"Right click a costume and 2 new menu items are present. These can be used to send the clicked sprite to the top or bottom of the list of costumes for fast re-ordering.","editor-devtools/youtube":"YouTube tutorials","editor-devtools/orphaned":"{count, plural, one {Griffpatch: I found 1 orphaned reporter block. Shall I delete it for you?} other {Griffpatch: I found # orphaned reporter blocks. Shall I delete them for you?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: I found 1 unused local variable. Shall I delete it for you? Here it is:\n} other {Griffpatch: I found # unused local variables. Shall I delete them for you? Here they are:\n} }","editor-devtools/searching-in":"Searching in {name}","editor-devtools/var-not-exist":"That variable does not exist...","editor-devtools/find":"Find","editor-devtools/find-placeholder":"Find (Ctrl+F)","editor-devtools/deep":"Deep","editor-devtools/help":"Help","editor-devtools/tutorials":"Tutorials","editor-devtools/enter-expr":"Griffpatch: Enter an expression (i.e. a+2*3)","editor-devtools/replace":"Griffpatch: Switch all {name} in this sprite for the variable named:","editor-devtools/top":"send to top","editor-devtools/bottom":"send to bottom","editor-devtools/clean-plus":"Clean Up Blocks (+)","editor-devtools/paste":"Paste","editor-devtools/copy-all":"Copy All","editor-devtools/copy-block":"Copy Block","editor-devtools/cut-block":"Cut Block","editor-devtools/swap":"Swap {var} in sprite","editor-devtools/lists":"lists","editor-devtools/variables":"variables","editor-devtools/insert":"Insert","editor-devtools/start-typing":"Start Typing...","editor-devtools/extension-description-not-for-addon":"Scratch 3 Developer Tools to enhance your Scratch Editing Experience on https://scratch.mit.edu"}