{"editor-devtools/version":"Različica {version} - Objavljeno {date} {ndash} {url} ter sodelavci in prevajalci Scratch Addons","editor-devtools/changes024":"Spremembe v 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + presledek ali srednji miškin gumb","editor-devtools/ctrl-space-desc":"Poskusna funkcija - pokaže polje, v katerega lahko vnesete ime (ali del imena) bloka in ga povlečete v kodo, da ga takoj uporabite.","editor-devtools/fixes":"Popravki","editor-devtools/fixes-desc":"Popravljena je napaka, ki je povzročila, da se polje za vnos ni prikazalo pri nalaganju projekta. Popravljeno je pritiskanje tipk Ctrl+levo in Ctrl+desno med vnašanjem besedila.","editor-devtools/code-tab-features":"Funkcije na zavihku Koda","editor-devtools/interactive-find-bar":"Interaktivna iskalna vrstica (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Hitro najdite katerikoli \"moj blok\", spremenljivko ali dogodek v figuri, tako da kliknete novo iskalno vrstico desno od zavihkov Koda, Videzi in Zvoki. Začnite tipkati za iskanje po seznamu. Uporabite tipki gor in dol da izberete možne zadetke ter tipki levo in desno da izberete posamezno pojavitev tistega bloka.","editor-devtools/improved-tidy-up":"Izboljšano čiščenje kode","editor-devtools/improved-tidy-up-desc":"Kliknite na okno s kodo z desno miškino tipko, da odprete meni, kjer je možnost \"počisti bloke\" zamenjana z \"počisti bloke (+)\". Uporabite jo, da uredite svoje skripte, in ohranila bo razporeditev po stolpcih ter poskusila poravnati komentarje in odstraniti tiste neuporabljene spremenljivke, itd. Zanesljivo vam bo zelo všeč!","editor-devtools/copy-to-clipboard":"Kopiraj v odložišče","editor-devtools/copy-to-clipboard-desc":"Kliknite na blok z desno tipko in na voljo bodo 3 nove možnosti: Kopiraj vse, Kopiraj blok in Izreži blok. Kopiraj vse kopira blok, ki ste ga kliknili, in vse, kar je pod njim. Kopiraj blok kopira trenutni blok, ne pa tudi blokov pod njim. In Izreži blok ga kopira in odstrani iz delovnega prostora.","editor-devtools/paste-from-clipboard":"Prilepi z odložišča","editor-devtools/paste-from-clipboard-desc":"Prilepi bloke z odložišča, ampak jih postavi tja, kjer je miškin kazalec, da jih lahko potem postavite, kamor želite (namesto da bi jih prilepil tja, od koder ste jih kopirali, kakor trenutna različica Scratcha).","editor-devtools/swap-variable":"Zamenjaj spremenljivko v figuri","editor-devtools/swap-variable-desc":"Kliknite spremenljivko v kodi z desno miškino tipko, da uporabite to novo možnost. Omogoča, da spremenite vso kodo v trenutni figuri, ki se nanaša na to spremenljivko, v drugo spremenljivko. To je odlično, če ste se zmotili in bi radi uporabili drugo spremenljivko ali pa morate spremeniti spremenljivko za vse figure v spremenljivko za to figuro. Ta možnost ne bo odstranila stare spremenljivke in ne vpliva na spremenljivke v ostalih figurah.","editor-devtools/middleclick":"Srednja miškina tipka","editor-devtools/middleclick-desc":"Če uporabite srednji miškin gumb na spremenljivki ali \"mojem bloku\", lahko skočite na njegovo definicijo ali spremenljivko odprete v interaktivnem iskalnem polju.","editor-devtools/ctrl-lr":"Ctrl + desno, Ctrl + levo","editor-devtools/ctrl-lr-desc":"Premaknite se na prejšnji / naslednji obiskan položaj v oknu s skriptami (potem ko uporabite srednji miškin gumb ali iskalno vrstico). To vam omogoča, da kliknete blok s srednjo miškino tipko da se premaknete na njegovo definicijo, potem pa pritisnete Ctrl + levo da se vrnete na prejšnji položaj.","editor-devtools/costume-tab-features":"Funkcije na zavihku Videzi","editor-devtools/find-bar":"Iskalna vrstica","editor-devtools/find-bar-costume-desc":"Kliknite za seznam vseh videzov, razvrščenih po imenu, in vnesite ime za iskanje. Uporabite puščice ali kliknite ime z miško, da se premaknete na izbran videz.","editor-devtools/ctrl-lr-costume-desc":"Ti tipki izbereta prejšnji / naslednji videz figure.","editor-devtools/send-top-bottom":"Na vrh, Na dno","editor-devtools/send-top-bottom-desc":"Ko kliknete videz z desno miškino tipko, sta v meniju 2 novi možnosti. Uporabite jih, da premaknete izbran videz na vrh ali na dno seznama videzov za hitro preurejanje.","editor-devtools/youtube":"Vodiči na YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Našel sem 1 neuporabljen okrogel blok. Naj ga izbrišem?} two {Griffpatch: Našel sem 2 neuporabljena okrogla bloka. Naj ju izbrišem?} few {Griffpatch: Našel sem # neuporabljene okrogle bloke. Naj jih izbrišem?} other {Griffpatch: Našel sem # neuporabljenih okroglih blokov. Naj jih izbrišem?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Našel sem 1 neuporabljeno lokalno spremenljivko. Naj jo izbrišem? Tukaj je:\n} two {Griffpatch: Našel sem 2 neuporabljeni lokalni spremenljivki. Naj ju izbrišem? Tukaj sta:\n} few {Griffpatch: Našel sem # neuporabljene lokalne spremenljivke. Naj jih izbrišem? Tukaj so:\n} other {Griffpatch: Našel sem # neuporabljenih lokalnih spremenljivk. Naj jih izbrišem? Tukaj so:\n} }","editor-devtools/searching-in":"Iskanje po {name}","editor-devtools/var-not-exist":"Ta spremenljivka ne obstaja...","editor-devtools/find":"Iskanje","editor-devtools/find-placeholder":"Iskanje (Ctrl+F)","editor-devtools/deep":"Globoko iskanje","editor-devtools/help":"Pomoč","editor-devtools/tutorials":"Vodiči","editor-devtools/enter-expr":"Griffpatch: Vnesi izraz (npr. a+2*3)","editor-devtools/replace":"Griffpatch: Spremeni vse {name} v tej figuri v spremenljivko z imenom:","editor-devtools/top":"na vrh","editor-devtools/bottom":"na dno","editor-devtools/clean-plus":"Počisti bloke (+)","editor-devtools/paste":"Prilepi","editor-devtools/copy-all":"Kopiraj vse","editor-devtools/copy-block":"Kopiraj blok","editor-devtools/cut-block":"Izreži blok","editor-devtools/swap":"Zamenjaj {var} v figuri","editor-devtools/lists":"seznami","editor-devtools/variables":"spremenljivke","editor-devtools/insert":"Vstavi","editor-devtools/start-typing":"Začnite tipkati...","editor-devtools/extension-description-not-for-addon":"Scratch 3 Developer Tools izboljša urejanje projektov na https://scratch.mit.edu","editor-devtools/@description":"Doda iskalno polje in nove možnosti v menijih v urejevalnik: kopiranje blokov, boljše čiščenje, skok k definiciji bloka, in drugo."}