{"editor-devtools/help-title":"Scratch 3 Geliştirici Araçları","editor-devtools/changes024":"0.2.3 - 0.2.4 arasındaki değişliklikler","editor-devtools/ctrl-space":"Ctrl + Boşluk veya Orta Tık","editor-devtools/fixes":"Düzeltmeler","editor-devtools/fixes-desc":"Proje yükünde görünmeyen giriş kutusu için düzeltme. Metin girmeye çalışırken Ctrl+Sol veya Sağ tuşlarına basma sorunu düzeltildi.","editor-devtools/code-tab-features":"Kod Sekmesi Özellikleri","editor-devtools/interactive-find-bar":"Etkileşimli Bul Çubuğu (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Kod, Kostümler ve Ses sekmelerinin sağında bulunan yeni bulma çubuğuna tıklayarak hareketli grafikte tanımlanan herhangi bir Özel Blok, Değişken, Etkinlik veya Şapka bloğunu hızlı bir şekilde bulun ve atlayın. Listeyi filtrelemek için yazmaya başlayın. Olası girişler arasında geçiş yapmak için yukarı ve aşağı ok tuşlarını ve bu bloğun bulunan tüm örnekleri arasında geçiş yapmak için sol ve sağ okları kullanın.","editor-devtools/improved-tidy-up":"Geliştirilmiş Kod Düzenlemesi","editor-devtools/help-new":"★Yeni★","editor-devtools/copy-to-clipboard":"Panoya Kopyala","editor-devtools/copy-to-clipboard-desc":"Bir bloğa sağ tıkladığınızda Tümünü Kopyala, Bloğu Kopyala ve Bloğu Kes için 3 yeni seçenek mevcuttur. Tümünü Kopyala, tıkladığınız blok dahil ve altındaki her şeyi panoya kopyalayacaktır. Bloğu kopyala yalnızca mevcut bloğu ve içeriğini kopyalayacak, ancak aşağıda hiçbir şey kopyalanmayacaktır. Ve kesme bloğu onu kopyalayacak ve çalışma alanından kaldıracaktır.","editor-devtools/paste-from-clipboard":"Panodan Yapıştır","editor-devtools/paste-from-clipboard-desc":"fare imlecinizin olduğu yere yapıştırır, böylece daha sonra yerleştirebilirsiniz (mevcut çizik uygulaması gibi kopyaladığınız yere yerleştirmek yerine).","editor-devtools/swap-variable":"Kukla'daki değişken ile takas","editor-devtools/swap-variable-desc":"Bu yeni seçenek için komut dosyalarınızdaki bir değişkeni sağ tıklayın. Mevcut hareketli grafikteki bu değişkene yapılan tüm referansları tek seferde başka bir değişkene geçirmenize olanak tanır. Bu, bir hata yaptığınızda ve bir değişkenden diğerine geçmek istediğinizde ya da 'tüm hareketli karakterler için' ile 'yalnızca bu hareketli grafik için' arasında değişiklik yapmanız gerektiğinde harikadır. Bu seçenek eski değişkeni kaldırmayacak ve diğer kuklaların değişkenlerini etkilemeyecektir.","editor-devtools/middleclick":"Orta tıklama","editor-devtools/middleclick-desc":"Bir değişken veya özel blokta orta fare düğmesini kullanmak, tanımına atlamanıza veya etkileşimli bulma çubuğunda açmanıza olanak tanır.","editor-devtools/ctrl-lr":"Ctrl + Sol, Ctrl + Sağ","editor-devtools/ctrl-lr-desc":"Komut dosyası penceresinde önceki / sonraki ziyaret edilen konuma gidin (engellemek veya bulmak için gezinme çubuğunu kullandıktan sonra). Bu, tanımına gitmek için özel bir bloğun ortasına tıklamanıza ve daha önce bulunduğunuz yere geri dönmek için ctrl + Sol tuşlarına basmanıza olanak tanır.","editor-devtools/costume-tab-features":"Kostüm Sekmesi Özellikleri","editor-devtools/find-bar":"Bul Çubuğu","editor-devtools/find-bar-costume-desc":"Tüm kostümleri isme göre listelemek için tıklayın ve birini bulmak için yazın. Doğrudan o kostüme gitmek için bir isme tıklamak için ok tuşlarını veya fareyi kullanın.","editor-devtools/ctrl-lr-costume-desc":"Bu tuşlar sizi kukladaki önceki / sonraki kostüme götürür.","editor-devtools/send-top-bottom":"Yukarıya Gönder, Aşağıya Gönder","editor-devtools/send-top-bottom-desc":"Bir kostüme sağ tıklayın ve 2 yeni menü öğesi mevcut. Bunlar, tıklanan hareketli grafiği, hızlı yeniden düzenlemek vermek için kostüm listesinin üstüne veya altına göndermek için kullanılabilir.","editor-devtools/youtube":"YouTube öğreticileri","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Kullanılmayan 1 tane değişken buldum. Onları sileyim mi? İşte buradalar.} other {Griffpatch: Kullanılmayan # tane değişken buldum. Onları sileyim mi? İşte buradalar.} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Kullanılmayan 1 adet değişken buldum. Onları senin için sileyim mi? İşte buradalar:\n} other {Griffpatch: Kullanılmayan # adet değişken buldum. Onları senin için sileyim mi? İşte buradalar:\n} }","editor-devtools/searching-in":"{name}Aranıyor","editor-devtools/var-not-exist":"Bu değişken hiç var olmadı...","editor-devtools/find":"Bul","editor-devtools/find-placeholder":"Bul (Ctrl+F)","editor-devtools/deep":"Derin","editor-devtools/help":"Yardım","editor-devtools/tutorials":"Öğreticiler","editor-devtools/enter-expr":"Griffpatch: Bir ifade girin (ör. a+2 * 3)","editor-devtools/replace":"Griffpatch: {name} isimli değişkeni bu kukladaki tüm değişkenler için değiştir:","editor-devtools/top":"Yukarıya Gönder","editor-devtools/bottom":"Aşağıya Gönder","editor-devtools/paste":"Yapıştır","editor-devtools/copy-all":"Hepsini Kopyala","editor-devtools/copy-block":"Bloğu Kopyala","editor-devtools/cut-block":"Bloğu kes","editor-devtools/lists":"listeler","editor-devtools/variables":"değişkenler","editor-devtools/insert":"Ekle","editor-devtools/start-typing":"Yazmaya Başla...","editor-devtools/@name":"Geliştirici araçları","editor-devtools/@description":"Düzenleyiciye bir arama kutusu ve yeni menü seçenekleri ekler: Blokları kopyalama/yapıştırma, daha iyi düzenleme, özel blok tanımına gitme ve daha fazlası!"}