{"editor-devtools/help-title":"Ferramentas de Desenvolvedor do Scratch 3","editor-devtools/version":"Versão {version} - Lançada em {date} {ndash} por {url} e pelos contribuidores e tradutores do Scratch Addons","editor-devtools/changes024":"Mudanças na 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Ctrl + Espaço ou Botão do Meio do Mouse","editor-devtools/ctrl-space-desc":"Função Experimental - Isso abre uma caixa flutuante onde você pode digitar o nome de um bloco (ou partes dele) e arrastar o bloco ao seu código para usá-lo.","editor-devtools/fixes":"Consertos","editor-devtools/fixes-desc":"Consertado erro da caixa de pesquisa não aparecer depois de um projeto carregar. Consertado problema de apertar Ctrl+Esquerda ou Direita enquanto tenta escrever texto.","editor-devtools/code-tab-features":"Funções da Aba de Código","editor-devtools/interactive-find-bar":"Barra de Busca Interativa (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Encontre e vá para qualquer Bloco Customizado, Variável, Evento ou bloco de Chapéu definido em um ator rapidamente clicando na nova barra de busca localizada à direita das abas de Código, Fantasias e Som. Comece a digitar para pesquisar na lista. Use as setas de cima e baixo para trocar entre as opções possíveis, e as setas esquerda e direita para trocar entre todas as aparições daquele bloco.","editor-devtools/improved-tidy-up":"Melhorada Organização de Blocos","editor-devtools/improved-tidy-up-desc":"Clique com o botão direito na janela de scripts para abrir o menu e a opção de limpar blocos será trocada pela opção Limpar Blocos (+). Clique para organizar seus blocos e as colunas serão mantidas, seus comentários também serão alinhados, seus variáveis órfãos removidos, etc. Você vai gostar bastante eu garanto!","editor-devtools/copy-to-clipboard":"Copiar para a Área de Transferência","editor-devtools/copy-to-clipboard-desc":"Clique com o botão direito em um bloco e 3 novas opções aparecem para Copiar Pilha, Copiar Bloco e Recortar Bloco. Copiar Pilha vai copiar para a área de transferência todos os blocos conectados abaixo do que você clicou. Copiar Bloco vai copiar só o bloco que você clicou e os seus conteúdos, nada conectado nele abaixo. E Recortar Bloco vai copiá-lo e removê-lo da área de scripts.","editor-devtools/paste-from-clipboard":"Colar da Área de Trabalho","editor-devtools/paste-from-clipboard-desc":"Cola da área de trabalho onde o seu mouse estiver para que você possa colocar o bloco onde quiser (ao invés de colar o bloco na mesma posição onde você copiou como a implementação atual do Scratch faz).","editor-devtools/swap-variable":"Trocar Variável no Ator","editor-devtools/swap-variable-desc":"Clique com o botão direito em uma variável para ver essa opção. Ela te deixa trocar todas as aparições dessa variável no ator atual de uma vez por outra variável. Isso é ótimo para quando você fez um erro e quer trocar uma variável por outra ou precisa trocar uma variável 'para todos os atores' por uma 'apenas para este ator'. Essa opção não remove a variável antiga e não vai afetar as variáveis de outros atores.","editor-devtools/middleclick":"Botão do Meio","editor-devtools/middleclick-desc":"Use o botão do meio em uma variável ou bloco customizável para ir até a sua definição ou abri-lo na barra de pesquisa interativa.","editor-devtools/ctrl-lr":"Ctrl + Esquerda, Ctrl + Direita","editor-devtools/ctrl-lr-desc":"Navegar até a posição anterior / posterior visitada na janela de scripts (depois de usar a função de navegar até um bloco ou a barra de busca). Isso te deixa clicar com o botão do meio em um bloco customizado para ver a definição e apertar Ctrl + Esquerda para voltar a onde você estava.","editor-devtools/costume-tab-features":"Funções da Aba de Fantasias","editor-devtools/find-bar":"Barra de Busca","editor-devtools/find-bar-costume-desc":"Clique para listar todas as fantasias por nome, ou digite para procurar uma. Use as setas ou o mouse para clicar em um nome e ir direto àquela fantasia.","editor-devtools/ctrl-lr-costume-desc":"Essas setas te levam à fantasia anterior / posterior no ator.","editor-devtools/send-top-bottom":"Enviar ao Topo, Enviar ao Fundo","editor-devtools/send-top-bottom-desc":"Clique com o botão direito em uma fantasia e 2 novos itens no menu aparecem. Esses podem ser usados para enviar a fantasia para o topo ou o fundo da lista de fantasias para organizar mais rápido.","editor-devtools/youtube":"Tutoriais no YouTube","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Achei 1 bloco redondo órfão. Posso deletar?} other {Griffpatch: Achei # blocos redondos órfãos. Posso deletar?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Achei 1 variável local não utilizada. Posso deletar? É essa aqui:\n} other {Griffpatch: Achei # variáveis locais não utilizadas. Posso deletar? São essas aqui:\n} }","editor-devtools/searching-in":"Buscando em {name}","editor-devtools/var-not-exist":"Essa variável não existe...","editor-devtools/find":"Buscar","editor-devtools/find-placeholder":"Buscar (Ctrl+F)","editor-devtools/deep":"Profundo","editor-devtools/help":"Ajuda","editor-devtools/tutorials":"Tutoriais","editor-devtools/enter-expr":"Griffpatch: Digite uma expressão (ex: a+2*3)","editor-devtools/replace":"Griffpatch: Trocar {name} nesse ator pela variável chamada:","editor-devtools/top":"enviar ao topo","editor-devtools/bottom":"enviar ao fundo","editor-devtools/clean-plus":"Limpar Blocos (+)","editor-devtools/paste":"Colar","editor-devtools/copy-all":"Copiar Pilha","editor-devtools/copy-block":"Copiar Bloco","editor-devtools/cut-block":"Recortar Bloco","editor-devtools/swap":"Trocar {var} no ator","editor-devtools/lists":"listas","editor-devtools/variables":"variáveis","editor-devtools/insert":"Inserir","editor-devtools/start-typing":"Comece a Digitar...","editor-devtools/extension-description-not-for-addon":"Ferramentas de Desenvolvedor do Scratch 3 para melhorar sua experiência de edição em https://scratch.mit.edu","editor-devtools/@name":"Ferramentas de desenvolvedor","editor-devtools/@description":"Adiciona uma caixa de busca e novas opções de menu ao editor: copiar/colar blocos, organização melhor, ir para a definição de um bloco customizado, e mais!"}