{"editor-devtools/help-title":"Scratch 3 Entwickler-Tools","editor-devtools/version":"Version {version} - Veröffentlicht am {date} {ndash} von {url} und den Scratch Addons Mitarbeitern und Übersetzern","editor-devtools/changes024":"Veränderungen in 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Strg + Leertaste oder mittlere Maustaste","editor-devtools/ctrl-space-desc":"Experimentelle Funktion - Dies erstellt ein Pop-up indem du den Namen eines Blockes eingeben kannst (oder nur teile davon) um den Block dann von dort aus in deinem Code verwenden zu können.","editor-devtools/fixes":"Korrekturen","editor-devtools/fixes-desc":"Korrektur für Eingabefeld, das beim Laden des Projektes nicht angezeigt wird. Korrektur für das Drücken von Strg+Links- oder Rechtsklick während der Texteingabe.","editor-devtools/code-tab-features":"Code Tab Funktionen","editor-devtools/interactive-find-bar":"Interaktive Suchleiste (Strg + F)","editor-devtools/interactive-find-bar-desc":"Finden und springe schnell zu jedem \"Meine Blöcke\" Block, jeder Variable, jedem Ereignis- oder Hutblock, der in einer Figur definiert ist, indem Sie auf die neue Suchleiste rechts neben dem Skripte, Kostüme und Klänge Tab klicken. Beginne mit der Eingabe, um die Liste herunter zu filtern. Verwende die Pfeiltasten oben und unten, um zwischen den möglichen Einträgen zu wechseln, und die Pfeile links und rechts, um zwischen allen gefundenen Instanzen dieses Blocks zu wechseln.","editor-devtools/improved-tidy-up":"Verbesserte Code-Aufräumung","editor-devtools/improved-tidy-up-desc":"Klicke mit der rechten Maustaste auf das Skriptfenster, um das Menü aufzurufen, und die Option aufräumen wird durch die Option Blöcke aufräumen (+) ersetzt worden sein. Wenn diese Option angeklickt wird, um Ihre Skripte aufzuräumen, bleiben Skriptspalten erhalten, es wird versucht, die Kommentare richtig auszurichten und alle verwaisten Variablen zu entfernen usw. Ich garantiere, dass du dies mögen wirst!","editor-devtools/copy-to-clipboard":"In die Zwischenablage kopieren","editor-devtools/copy-to-clipboard-desc":"Wenn mit der rechten Maustaste auf ein Block geklickt wird, stehen 3 neue Optionen zur Verfügung: Alle kopieren, Block kopieren und Block ausschneiden. Die Option Alles kopieren kopiert alles einschließlich die Blöcke unterhalb des angeklickten Blockes in die Zwischenablage. Block kopieren kopiert nur den angeklickten Block und seinen Inhalt, sonst nichts. Block ausschneiden kopiert ihn und entfernt ihn aus dem Arbeitsbereich.","editor-devtools/paste-from-clipboard":"Einfügen aus der Zwischenablage","editor-devtools/paste-from-clipboard-desc":"Fügt von der Zwischenablage ein, aber an der Stelle, an der sich der Mauszeiger befindet, damit Sie es dann platzieren können (und nicht wie bei der aktuellen Scratch-Implementierung an der Stelle, von dem zu kopierenden Block).","editor-devtools/swap-variable":"Variable in Figur austauschen","editor-devtools/swap-variable-desc":"Klicke mit der rechten Maustaste auf eine Variable in Skripten für diese neue Option. Erlaubt es, alle Verweise auf diese Variable in der aktuellen Figur auf einmal auf eine andere Variable umzuschalten. Eignet sich hervorragend, wenn ein Fehler gemacht wurde und von einer Variable zu einer anderen gewechselt werden soll oder von einem \"für alle Figuren\" zu einem \"Nur für diese Figur\" wechseln müssen. Diese Option wird die alte Variable nicht entfernen und wird keine anderen Figuren-Variablen beeinflussen.","editor-devtools/middleclick":"Mittelklick","editor-devtools/middleclick-desc":"Bei Benutzung der mittleren Maustaste auf einer Variable oder einem \"Meine Blöcke\" Block springt man zu seiner Definition oder öffnet ihn in der interaktiven Suchleiste.","editor-devtools/ctrl-lr":"Strg + Links, Strg + Rechts","editor-devtools/ctrl-lr-desc":"Navigiere im Skript zur vorherigen/nächsten Position (nach Verwendung der zum-Block-navigieren oder Suchleiste). Auf diese Weise kann mit einem Mittelklick auf einen \"Meine Blöcke\" Block zu seiner Definition gesprungen werden und danach Strg + Linksklick um zu der Stelle zurückzukehren, an dem man sich zuvor befunden hat.","editor-devtools/costume-tab-features":"Kostüme-Tab Funktionen","editor-devtools/find-bar":"Suchleiste","editor-devtools/find-bar-costume-desc":"Klicke um alle Kostüme nach Namen aufzulisten und tippe etwas ein um eines zu finden. Benutze die Pfeiltasten oder die Maus auf einen Namen, um direkt zu diesem Kostüm zu gelangen.","editor-devtools/ctrl-lr-costume-desc":"Diese Tasten navigieren dich zum vorherigen/nächsten Kostüm in der Figur.","editor-devtools/send-top-bottom":"Nach oben schicken, Nach unten schicken","editor-devtools/send-top-bottom-desc":"Rechtsklick auf ein Kostüm zeigt 2 neue Menüpunkte an. Diese können verwendet werden, um die angeklickte Figur an den Anfang oder an das Ende der Kostümliste zu schicken, damit es schnell umgeordnet werden kann.","editor-devtools/youtube":"YouTube Tutorials","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Ich habe 1 alleinstehenden Block gefunden. Soll ich sie löschen?} other {Griffpatch: Ich habe # alleinstehende Blöcke gefunden. Soll ich es löschen?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Ich habe 1 unbenutzte Variable gefunden. Soll ich sie löschen? Hier sind sie:\n} other {Griffpatch: Ich habe # unbenutzte Variablen gefunden. Soll ich sie löschen? Hier sind sie:\n} }","editor-devtools/searching-in":"Es wird in {name} gesucht","editor-devtools/var-not-exist":"Diese Variable existiert nicht...","editor-devtools/find":"Finde","editor-devtools/find-placeholder":"Finde (Strg + F)","editor-devtools/deep":"Tief","editor-devtools/help":"Hilfe","editor-devtools/enter-expr":"Griffpatch: Gebe einen Ausdruck ein (z.B. a+2*3)","editor-devtools/replace":"Griffpatch: Alle {name} in dieser Figur austauschen mit der Variable namens:","editor-devtools/top":"Nach oben schicken","editor-devtools/bottom":"Nach unten schicken","editor-devtools/clean-plus":"Blöcke aufräumen (+)","editor-devtools/paste":"Einfügen","editor-devtools/copy-all":"Alles Kopieren","editor-devtools/copy-block":"Block Kopieren","editor-devtools/cut-block":"Block Ausschneiden","editor-devtools/swap":"Tausche {var} in der Figur","editor-devtools/lists":"Listen","editor-devtools/variables":"Variablen","editor-devtools/insert":"Einfügen","editor-devtools/start-typing":"Fange an zu tippen...","editor-devtools/extension-description-not-for-addon":"Scratch 3 Entwicklertools, um die eigene Erfahrung beim Programmieren auf https://scratch.mit.edu zu optimieren","editor-devtools/@name":"Entwicklertools","editor-devtools/@description":"Fügt eine Suchbox und neue Menüoptionen zu den Editor hinzu: Kopieren/Einfügen von Blöcken, besseres Aufräumen, gehe zu \"meine Blöcke\" Blockdefinitionen und vieles mehr!"}