{"editor-devtools/help-title":"Scratch 3-Entwicklertools","editor-devtools/version":"Version {version} - Veröffentlicht am {date} {ndash} von {url} und den Scratch Addons-Mitarbeitern und -Übersetzern","editor-devtools/changes024":"Änderungen in 0.2.3 - 0.2.4","editor-devtools/ctrl-space":"Strg + Leertaste oder mittlere Maustaste","editor-devtools/ctrl-space-desc":"Experimentelle Funktion - Dies erstellt ein Pop-up, indem du den Namen eines Blocks eingeben kannst (oder nur Teile davon) eingeben kannst, um den Block dann von dort aus in deinem Code verwenden zu können.","editor-devtools/fixes":"Verbesserungen","editor-devtools/fixes-desc":"Verbesserung für Eingabefeld, das beim Laden des Projektes nicht angezeigt wurde. Verbesserung für das Drücken von Strg+Links oder Rechts während der Eingabe.","editor-devtools/code-tab-features":"Code-Tab-Funktionen","editor-devtools/interactive-find-bar":"Interaktive Suchleiste (Strg + F)","editor-devtools/interactive-find-bar-desc":"Finde und springe schnell zu jedem Benutzerdefinierten Block, jeder Variable, jedem Ereignis- oder Startblock, der in einer Figur definiert ist, indem du auf die neue Suchleiste rechts neben den Skripte-, Kostüme- und Klänge-Tabs klickst. Beginne mit der Eingabe, um die Liste herunter zu filtern. Verwende die Pfeiltasten oben und unten, um zwischen den möglichen Einträgen zu wechseln, und die Pfeile links und rechts, um zwischen allen gefundenen Instanzen dieses Blocks zu wechseln.","editor-devtools/improved-tidy-up":"Verbessertes Aufräumen von Blöcken","editor-devtools/improved-tidy-up-desc":"Klicke mit der rechten Maustaste auf das Skriptfenster, um das Menü aufzurufen, und die Option aufräumen wird durch die Option Blöcke aufräumen (+) ersetzt worden sein. Wenn diese Option angeklickt wird, um Ihre Skripte aufzuräumen, bleiben Skriptspalten erhalten, es wird versucht, die Kommentare richtig auszurichten und alle verwaisten Variablen zu entfernen usw. Ich garantiere, dass du dies mögen wirst!","editor-devtools/copy-to-clipboard":"In Zwischenablage kopieren","editor-devtools/copy-to-clipboard-desc":"Wenn mit der rechten Maustaste auf einen Block geklickt wird, stehen 3 neue Optionen zur Verfügung: Alle Kopieren, Block Kopieren und Block Ausschneiden. Die Option Alles Kopieren kopiert alles einschließlich die Blöcke unterhalb des angeklickten Blockes in die Zwischenablage. Block Kopieren kopiert nur den angeklickten Block und seinen Inhalt, sonst nichts. Block Ausschneiden kopiert ihn und entfernt ihn aus dem Arbeitsbereich.","editor-devtools/paste-from-clipboard":"Aus Zwischenablage einfügen","editor-devtools/paste-from-clipboard-desc":"Fügt von der Zwischenablage ein, aber an der Stelle, an der sich der Mauszeiger befindet, damit Sie es dann platzieren können (und nicht wie bei der aktuellen Scratch-Implementierung an der Stelle, von dem zu kopierenden Block).","editor-devtools/swap-variable":"Variable in Figur austauschen","editor-devtools/swap-variable-desc":"Klicke mit der rechten Maustaste auf eine Variable in Skripten für diese neue Option. Erlaubt es, alle Verweise auf diese Variable in der aktuellen Figur auf einmal auf eine andere Variable umzuschalten. Eignet sich hervorragend, wenn ein Fehler gemacht wurde und von einer Variable zu einer anderen gewechselt werden soll oder von einem \"für alle Figuren\" zu einem \"Nur für diese Figur\" wechseln müssen. Diese Option wird die alte Variable nicht entfernen und wird keine Variablen in anderen Figuren beeinflussen.","editor-devtools/middleclick":"Mittelklick","editor-devtools/middleclick-desc":"Bei Benutzung der mittleren Maustaste auf einer Variable oder einem Benutzerdefinierten Block springt man zu seiner Definition oder öffnet ihn in der interaktiven Suchleiste.","editor-devtools/ctrl-lr":"Strg + Links, Strg + Rechts","editor-devtools/ctrl-lr-desc":"Navigiere im Skript zur vorherigen/nächsten Position (nach Verwendung der zum-Block-navigieren oder Suchleiste). Auf diese Weise kann mit einem Mittelklick auf einen Benutzerdefinierten Block zu seiner Definition gesprungen werden und danach mit Strg + Linksklick zur Stelle zurückkehren, an der man sich zuvor befunden hat.","editor-devtools/costume-tab-features":"Kostümtab Funktionen","editor-devtools/find-bar":"Suchleiste","editor-devtools/find-bar-costume-desc":"Klicke, um alle Kostüme nach Namen aufzulisten und gib etwas ein, um eines zu finden. Benutze die Pfeiltasten oder die Maus auf einem Namen, um direkt zu diesem Kostüm zu gelangen.","editor-devtools/ctrl-lr-costume-desc":"Diese Tasten navigieren dich zum vorherigen/nächsten Kostüm in der Figur.","editor-devtools/send-top-bottom":"Nach oben schicken, Nach unten schicken","editor-devtools/send-top-bottom-desc":"Klicke mit der Rechten Maustaste auf ein Kostüm und siehe 2 neue Menüpunkte an. Diese können verwendet werden, um die angeklickte Figur an den Anfang oder ans Ende der Kostümliste zu schicken, was für schnelles Umordnen praktisch ist.","editor-devtools/youtube":"YouTube-Tutorials","editor-devtools/orphaned":"{count, plural, one {Griffpatch: Ich habe 1 alleinstehenden Block gefunden. Soll ich ihn löschen?} other {Griffpatch: Ich habe # alleinstehende Blöcke gefunden. Soll ich sie löschen?} }","editor-devtools/unused-var":"{count, plural, one {Griffpatch: Ich habe 1 unbenutzte Variable gefunden. Soll ich sie löschen? Hier ist sie:\n} other {Griffpatch: Ich habe # unbenutzte Variablen gefunden. Soll ich sie löschen? Hier sind sie:\n} }","editor-devtools/searching-in":"Es wird in {name} gesucht","editor-devtools/var-not-exist":"Diese Variable existiert nicht...","editor-devtools/find":"Finden","editor-devtools/find-placeholder":"Finde (Strg + F)","editor-devtools/deep":"Tief","editor-devtools/help":"Hilfe","editor-devtools/enter-expr":"Griffpatch: Gib einen Ausdruck ein (z.B. a+2*3)","editor-devtools/replace":"Griffpatch: Alle {name} in dieser Figur austauschen mit der Variable namens:","editor-devtools/top":"nach oben senden","editor-devtools/bottom":"nach unten senden","editor-devtools/clean-plus":"Blöcke aufräumen (+)","editor-devtools/paste":"Einfügen","editor-devtools/copy-all":"Alle Kopieren","editor-devtools/copy-block":"Block Kopieren","editor-devtools/cut-block":"Block Ausschneiden","editor-devtools/swap":"{var} in dieser Figur austauschen","editor-devtools/lists":"Listen","editor-devtools/variables":"Variablen","editor-devtools/insert":"Einfügen","editor-devtools/start-typing":"Beginn mit der Eingabe...","editor-devtools/extension-description-not-for-addon":"Entwicklertools für Scratch 3, um die eigene Erfahrung beim Programmieren auf https://scratch.mit.edu zu optimieren","editor-devtools/@name":"Entwicklertools","editor-devtools/@description":"Fügt ein Suchfeld und neue Menüoptionen zum Editor hinzu: Kopieren/Einfügen von Blöcken, besseres Aufräumen, gehe zu Definitionen von Benutzerdefinierten Blöcken und vieles mehr!"}